In [2]:
import pandas as pd
import numpy as np

In [3]:
dat_movies = pd.read_csv("../data/ml-1m/movies.dat",sep='::',encoding='latin-1',header=None,names=["MovieID","Title","Genres"])
dat_ratings = pd.read_csv("../data/ml-1m/ratings.dat",sep='::',encoding='latin-1',header=None,names=['UserID',"MovieID","Rating","Timestamp"])
dat_users = pd.read_csv("../data/ml-1m/users.dat",sep='::',encoding='latin-1',header=None,names=["UserID","Gender","Age","Occupation","Zip Code"])

C:\Users\harsh\AppData\Local\Temp\ipykernel_10652\284825200.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  dat_movies = pd.read_csv("../data/ml-1m/movies.dat",sep='::',encoding='latin-1',header=None,names=["MovieID","Title","Genres"])
C:\Users\harsh\AppData\Local\Temp\ipykernel_10652\284825200.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  dat_ratings = pd.read_csv("../data/ml-1m/ratings.dat",sep='::',encoding='latin-1',header=None,names=['UserID',"MovieID","Rating","Timestamp"])
C:\Users\harsh\AppData\Local\Temp\ipykernel_10652\284825200.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  dat_users = pd.read_csv("../data/ml-1m/users.dat",sep='::',encoding='latin-1',header=None,names=["UserID","Gender","Age","Occupation","Zip Code"])

In [35]:
dat_ratings

         UserID  MovieID  Rating  Timestamp
0             1     1193       5  978300760
1             1      661       3  978302109
2             1      914       3  978301968
3             1     3408       4  978300275
4             1     2355       5  978824291
...         ...      ...     ...        ...
1000204    6040     1091       1  956716541
1000205    6040     1094       5  956704887
1000206    6040      562       5  956704746
1000207    6040     1096       4  956715648
1000208    6040     1097       4  956715569

[1000209 rows x 4 columns]

In [4]:
dat_users

      UserID Gender  Age  Occupation Zip Code
0          1      F    1          10    48067
1          2      M   56          16    70072
2          3      M   25          15    55117
3          4      M   45           7    02460
4          5      M   25          20    55455
...      ...    ...  ...         ...      ...
6035    6036      F   25          15    32603
6036    6037      F   45           1    76006
6037    6038      F   56           1    14706
6038    6039      F   45           0    01060
6039    6040      M   25           6    11106

[6040 rows x 5 columns]

In [5]:
dat_movies

,MovieID,Title,Genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller